In [16]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [2]:
data=pd.read_csv("all_stocks_5yr.csv")

In [4]:
data.head()

         date   open   high    low  close    volume Name
0  2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1  2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2  2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3  2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4  2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL

In [6]:
data.isnull()

         date   open   high    low  close  volume   Name
0       False  False  False  False  False   False  False
1       False  False  False  False  False   False  False
2       False  False  False  False  False   False  False
3       False  False  False  False  False   False  False
4       False  False  False  False  False   False  False
...       ...    ...    ...    ...    ...     ...    ...
619035  False  False  False  False  False   False  False
619036  False  False  False  False  False   False  False
619037  False  False  False  False  False   False  False
619038  False  False  False  False  False   False  False
619039  False  False  False  False  False   False  False

[619040 rows x 7 columns]

In [7]:
data.isnull().sum()

date       0
open      11
high       8
low        8
close      0
volume     0
Name       0
dtype: int64

In [10]:
data.dropna(inplace=True)

In [11]:
data.isnull().sum()

date      0
open      0
high      0
low       0
close     0
volume    0
Name      0
dtype: int64

In [19]:
X = data[[ 'open','high','low','close']]
y = data['volume']

In [27]:
from sklearn import datasets,linear_model
from sklearn.model_selection import train_test_split

In [28]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)

In [29]:
reg=linear_model.LinearRegression()

In [30]:
reg.fit(X_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [33]:
print("accuracy is:",reg.score(X_test,y_test))

accuracy is: 0.024365063988075475